
export const defaultSeo = {
	id: "DEFAULT_SEO",
	title: "Twinsann",
	title_ru: "Twinsann",
	h: "Twinsann",
	h_ru: "Twinsann",
	description: "Twin Sann − найбільший онлайн-магазин з власним виробництвом меблів в Україні. З 2020 року ми втілюємо маленькі мрії та грандіозні плани тисяч людей. У нас можна замовити стільчики та пуфи будь-якого дизайну. Ми продаємо за справедливою ціною та надаємо гарантію, бо вважаємо, що онлайн-шопінг має бути максимально зручним і безпечним.",
	description_ru: "Twin Sann − найбільший онлайн-магазин з власним виробництвом меблів в Україні. З 2020 року ми втілюємо маленькі мрії та грандіозні плани тисяч людей. У нас можна замовити стільчики та пуфи будь-якого дизайну. Ми продаємо за справедливою ціною та надаємо гарантію, бо вважаємо, що онлайн-шопінг має бути максимально зручним і безпечним.",
	text: "Twin Sann − найбільший онлайн-магазин з власним виробництвом меблів в Україні. З 2020 року ми втілюємо маленькі мрії та грандіозні плани тисяч людей. У нас можна замовити стільчики та пуфи будь-якого дизайну. Ми продаємо за справедливою ціною та надаємо гарантію, бо вважаємо, що онлайн-шопінг має бути максимально зручним і безпечним.",
	text_ru: "Twin Sann − найбільший онлайн-магазин з власним виробництвом меблів в Україні. З 2020 року ми втілюємо маленькі мрії та грандіозні плани тисяч людей. У нас можна замовити стільчики та пуфи будь-якого дизайну. Ми продаємо за справедливою ціною та надаємо гарантію, бо вважаємо, що онлайн-шопінг має бути максимально зручним і безпечним.",
	hideSeoText: false
}